# сума = депозирана сума  + срок на депозита * ((депозирана сума * годишен лихвен процент ) / 12)
# Вход
# От конзолата се четат 3 реда:
#     1. Депозирана сума – реално число в интервала [100.00 … 10000.00]
#     2. Срок на депозита (в месеци) – цяло число в интервала [1…12]
#     3. Годишен лихвен процент – реално число в интервала [0.00 …100.00]
# Изход
# Да се отпечата на конзолата сумата в края на срока.

deposit_sum = float(input())
time_of_deposit = int(input())
year_prc = float(input())

final_price = deposit_sum + time_of_deposit * (deposit_sum * (year_prc / 100) / 12)
print(final_price)
